### Ex1: Tao dataframe

In [1]:
Name <- c("Alex", "Lilly", "Mark", "Oliver", "Martha", "Lucas", "Caroline")
Age <- c(25, 31, 23, 52, 76, 49, 26)
Height <- c(177, 163, 190, 179, 163, 183, 164)
Weight <- c(57, 69, 83, 75, 70, 83, 53)
Sex <- as.factor(c("F", "F", "M", "M", "F", "M", "F"))
df <- data.frame(row.names = Name, Age, Height, Weight, Sex)
df

         Age Height Weight Sex
Alex     25  177    57     F
Lilly    31  163    69     F
Mark     23  190    83     M
Oliver   52  179    75     M
Martha   76  163    70     F
Lucas    49  183    83     M
Caroline 26  164    53     F

In [2]:
#In level cua Sex
print(paste("Levels of Sex:",toString(levels(df$Sex))))

[1] "Levels of Sex: F, M"

In [3]:
#Tao dataframe moi
Working <- c("Yes","No","No","Yes","Yes","No","Yes")
df2 <- data.frame(row.names = Name, Working)
df2

         Working
Alex     Yes
Lilly    No
Mark     No
Oliver   Yes
Martha   Yes
Lucas    No
Caroline Yes

In [4]:
#Tao dataframe moi chua 2 dataframe df va df2
new_df <- cbind(df,df2)
new_df

         Age Height Weight Sex Working
Alex     25  177    57     F   Yes
Lilly    31  163    69     F   No
Mark     23  190    83     M   No
Oliver   52  179    75     M   Yes
Martha   76  163    70     F   Yes
Lucas    49  183    83     M   No
Caroline 26  164    53     F   Yes

In [5]:
#Cho biet so dong, so cot cua new dataframe
print(paste("Number of row and column :", dim(new_df)[1],"and", dim(new_df)[2]))

[1] "Number of row and column : 7 and 5"

In [6]:
#cho biet kieu du lieu cua tung cot
str(new_df)

'data.frame':	7 obs. of  5 variables:
 $ Age    : num  25 31 23 52 76 49 26
 $ Height : num  177 163 190 179 163 183 164
 $ Weight : num  57 69 83 75 70 83 53
 $ Sex    : Factor w/ 2 levels "F","M": 1 1 2 2 1 2 1
 $ Working: Factor w/ 2 levels "No","Yes": 2 1 1 2 2 1 2

### Ex2: Tao va lam viec voi dataframe

In [7]:
a <- (floor(runif(10, -10, 10)))
b <- letters[4:13]
c <- c("yes","no","no","no","no","yes","no","yes","yes","no")
df <- data.frame(a,b,c)
print(df)

    a b   c
1  -3 d yes
2  -5 e  no
3  -6 f  no
4   4 g  no
5  -7 h  no
6  -5 i yes
7   3 j  no
8   3 k yes
9  -1 l yes
10  6 m  no

In [8]:
#In dataframe voi thu tu duoc sap xep tang dan trong cot a
print(df[with(df,order(a)),])

    a b   c
5  -7 h  no
3  -6 f  no
2  -5 e  no
6  -5 i yes
1  -3 d yes
9  -1 l yes
7   3 j  no
8   3 k yes
4   4 g  no
10  6 m  no

In [9]:
#Tao matrix.data
matrix.data <- matrix(1:40, nrow = 10, ncol = 4)
print(matrix.data)

      [,1] [,2] [,3] [,4]
 [1,]    1   11   21   31
 [2,]    2   12   22   32
 [3,]    3   13   23   33
 [4,]    4   14   24   34
 [5,]    5   15   25   35
 [6,]    6   16   26   36
 [7,]    7   17   27   37
 [8,]    8   18   28   38
 [9,]    9   19   29   39
[10,]   10   20   30   40

In [10]:
#Tao dataframe tu matrix.data
df <- data.frame(matrix.data)
rownames(df)<- sub(" ","",paste("id_",1:nrow(df)))
colnames(df)<- sub(" ","",paste("variable_",1:ncol(df)))

In [11]:
df

      variable_1 variable_2 variable_3 variable_4
id_1   1         11         21         31
id_2   2         12         22         32
id_3   3         13         23         33
id_4   4         14         24         34
id_5   5         15         25         35
id_6   6         16         26         36
id_7   7         17         27         37
id_8   8         18         28         38
id_9   9         19         29         39
id_10 10         20         30         40

### Ex3: Làm việc với dataframe

In [12]:
#Su dung du lieu co san R state.77
print(head(state.x77))

           Population Income Illiteracy Life Exp Murder HS Grad Frost   Area
Alabama          3615   3624        2.1    69.05   15.1    41.3    20  50708
Alaska            365   6315        1.5    69.31   11.3    66.7   152 566432
Arizona          2212   4530        1.8    70.55    7.8    58.1    15 113417
Arkansas         2110   3378        1.9    70.66   10.1    39.9    65  51945
California      21198   5114        1.1    71.71   10.3    62.6    20 156361
Colorado         2541   4884        0.7    72.06    6.8    63.9   166 103766

In [13]:
#In kieu du lieu state.77
print(class(state.x77))

[1] "matrix"

In [14]:
state.x77.df <- data.frame(state.x77)

In [15]:
rows_state_4300 <- nrow(state.x77.df[state.x77.df$Income < 4300,])
print(paste("So State co Income < 4300:",rows_state_4300))

[1] "So State co Income < 4300: 20"

In [16]:
#In danh sach cac bang co Income < 4300
print('Danh sach cac State co Income < 4300')
print(state.x77.df[state.x77.df$Income < 4300,])

[1] "Danh sach cac State co Income < 4300"
               Population Income Illiteracy Life.Exp Murder HS.Grad Frost
Alabama              3615   3624        2.1    69.05   15.1    41.3    20
Arkansas             2110   3378        1.9    70.66   10.1    39.9    65
Georgia              4931   4091        2.0    68.54   13.9    40.6    60
Idaho                 813   4119        0.6    71.87    5.3    59.5   126
Kentucky             3387   3712        1.6    70.10   10.6    38.5    95
Louisiana            3806   3545        2.8    68.76   13.2    42.2    12
Maine                1058   3694        0.7    70.39    2.7    54.7   161
Mississippi          2341   3098        2.4    68.09   12.5    41.0    50
Missouri             4767   4254        0.8    70.69    9.3    48.8   108
New Hampshire         812   4281        0.7    71.23    3.3    57.6   174
New Mexico           1144   3601        2.2    70.32    9.7    55.2   120
North Carolina       5441   3875        1.8    69.21   11.1    38.5    80
Oklahoma             2715   3983        1.1    71.42    6.4    51.6    82
South Carolina       2816   3635        2.3    67.96   11.6    37.8    65
South Dakota          681   4167        0.5    72.08    1.7    53.3   172
Tennessee            4173   3821        1.7    70.11   11.0    41.8    70
Texas               12237   4188        2.2    70.90   12.2    47.4    35
Utah                 1203   4022        0.6    72.90    4.5    67.3   137
Vermont               472   3907        0.6    71.64    5.5    57.1   168
West Virginia        1799   3617        1.4    69.48    6.7    41.6   100
                 Area
Alabama         50708
Arkansas        51945
Georgia         58073
Idaho           82677
Kentucky        39650
Louisiana       44930
Maine           30920
Mississippi     47296
Missouri        68995
New Hampshire    9027
New Mexico     121412
North Carolina  48798
Oklahoma        68782
South Carolina  30225
South Dakota    75955
Tennessee       41328
Texas          262134
Utah            82096
Vermont          9267
West Virginia   24070

In [17]:
#In state co Income cao nhat
max_income <- max(state.x77.df$Income)

In [18]:
print(paste("State co Income cao nhat: ",row.names(state.x77.df[state.x77.df$Income == max_income,]), "voi Income:",max_income))

[1] "State co Income cao nhat:  Alaska voi Income: 6315"

In [19]:
#In state co Life.Exp cao nhat
max_life <- max(state.x77.df$Life.Exp)
print(paste("State co Life.Exp cao nhat: ",row.names(state.x77.df[state.x77.df$Life.Exp == max_life,]), "voi Life.Exp:",max_life))

[1] "State co Life.Exp cao nhat:  Hawaii voi Life.Exp: 73.6"

In [20]:
#In state co Life.Exp thap nhat
min_life <- min(state.x77.df$Life.Exp)
print(paste("State co Life.Exp thap nhat: ",row.names(state.x77.df[state.x77.df$Life.Exp == min_life,]), "voi Life.Exp:",min_life))

[1] "State co Life.Exp thap nhat:  South Carolina voi Life.Exp: 67.96"

### Ex4: Lam viec voi dataframe

In [21]:
df <- data.frame(row.names = state.name,state.abb, state.area, state.division, state.region)
print(head(df))

           state.abb state.area     state.division state.region
Alabama           AL      51609 East South Central        South
Alaska            AK     589757            Pacific         West
Arizona           AZ     113909           Mountain         West
Arkansas          AR      53104 West South Central        South
California        CA     158693            Pacific         West
Colorado          CO     104247           Mountain         West

In [22]:
colnames(df) <- substr(colnames(df),7,9)
print(head(df))

           abb    are                div   reg
Alabama     AL  51609 East South Central South
Alaska      AK 589757            Pacific  West
Arizona     AZ 113909           Mountain  West
Arkansas    AR  53104 West South Central South
California  CA 158693            Pacific  West
Colorado    CO 104247           Mountain  West

In [23]:
#Tao dataframe tu state.x77 va df moi tao
new_df <- cbind(state.x77, df)
print(head(new_df))

           Population Income Illiteracy Life Exp Murder HS Grad Frost   Area
Alabama          3615   3624        2.1    69.05   15.1    41.3    20  50708
Alaska            365   6315        1.5    69.31   11.3    66.7   152 566432
Arizona          2212   4530        1.8    70.55    7.8    58.1    15 113417
Arkansas         2110   3378        1.9    70.66   10.1    39.9    65  51945
California      21198   5114        1.1    71.71   10.3    62.6    20 156361
Colorado         2541   4884        0.7    72.06    6.8    63.9   166 103766
           abb    are                div   reg
Alabama     AL  51609 East South Central South
Alaska      AK 589757            Pacific  West
Arizona     AZ 113909           Mountain  West
Arkansas    AR  53104 West South Central South
California  CA 158693            Pacific  West
Colorado    CO 104247           Mountain  West

In [24]:
#Loai bo cac cot div, Life Exp, HS Grad, Frost, abb & are
new_df$`Life Exp` <- NULL
new_df$div <- NULL
new_df$`HS Grad` <- NULL
new_df$Frost <- NULL
new_df$abb <- NULL
new_df$are <- NULL
print(head(new_df))

           Population Income Illiteracy Murder   Area   reg
Alabama          3615   3624        2.1   15.1  50708 South
Alaska            365   6315        1.5   11.3 566432  West
Arizona          2212   4530        1.8    7.8 113417  West
Arkansas         2110   3378        1.9   10.1  51945 South
California      21198   5114        1.1   10.3 156361  West
Colorado         2541   4884        0.7    6.8 103766  West

In [25]:
#Add illiteracy.levels
new_df$illiteracy.levels <- ifelse(new_df$Illiteracy < 1,"Low", ifelse(new_df$Illiteracy < 2, "Some","High"))

In [26]:
print("New datafram after add illiteracy.levels:")
print(head(new_df))

[1] "New datafram after add illiteracy.levels:"
           Population Income Illiteracy Murder   Area   reg illiteracy.levels
Alabama          3615   3624        2.1   15.1  50708 South              High
Alaska            365   6315        1.5   11.3 566432  West              Some
Arizona          2212   4530        1.8    7.8 113417  West              Some
Arkansas         2110   3378        1.9   10.1  51945 South              Some
California      21198   5114        1.1   10.3 156361  West              Some
Colorado         2541   4884        0.7    6.8 103766  West               Low

In [27]:
#Cho biet co bao nhieu vung va la nhung vung nao
print(paste("Number of regions :",nlevels(new_df$reg)))
print(paste("Regions are:",toString(levels(new_df$reg))))

[1] "Number of regions : 4"
[1] "Regions are: Northeast, South, North Central, West"

### Ex5: Sử dụng function trong package Tidyverse

In [28]:
library(tidyverse)

Warning message:
"package 'tidyverse' was built under R version 3.6.3"-- Attaching packages --------------------------------------- tidyverse 1.3.0 --
v ggplot2 3.3.0     v purrr   0.3.3
v tibble  2.1.3     v dplyr   0.8.5
v tidyr   1.0.2     v stringr 1.4.0
v readr   1.3.1     v forcats 0.5.0
Warning message:
"package 'ggplot2' was built under R version 3.6.3"Warning message:
"package 'tibble' was built under R version 3.6.3"Warning message:
"package 'tidyr' was built under R version 3.6.3"Warning message:
"package 'readr' was built under R version 3.6.3"Warning message:
"package 'purrr' was built under R version 3.6.3"Warning message:
"package 'dplyr' was built under R version 3.6.3"Warning message:
"package 'stringr' was built under R version 3.6.3"Warning message:
"package 'forcats' was built under R version 3.6.3"-- Conflicts ------------------------------------------ tidyverse_conflicts() --
x dplyr::filter() masks stats::filter()
x dplyr::lag()    masks stats::lag()

In [29]:
#Cho du lieu Obesity_data.csv. Doc du lieu va dataframe. In head
Obesity.df <- read.csv("Data_buoi_4/Obesity_data.csv")
print(head(Obesity.df))

  id gender height weight  bmi age  bmc  bmd   fat  lean pcfat
1  1      F    150     49 21.8  53 1312 0.88 17802 28600  37.3
2  2      M    165     52 19.1  65 1309 0.84  8381 40229  16.8
3  3      F    157     57 23.1  64 1230 0.84 19221 36057  34.0
4  4      F    156     53 21.8  56 1171 0.80 17472 33094  33.8
5  5      M    160     51 19.9  54 1681 0.98  7336 40621  14.8
6  6      F    153     47 20.1  52 1358 0.91 14904 30068  32.2

In [30]:
#Tao dataframe data1 chua cac cot id,gender,height, weight, bmi. In head
data1 <- select(Obesity.df, c(id,gender,height, weight, bmi, age))
print(head(data1))

  id gender height weight  bmi age
1  1      F    150     49 21.8  53
2  2      M    165     52 19.1  65
3  3      F    157     57 23.1  64
4  4      F    156     53 21.8  56
5  5      M    160     51 19.9  54
6  6      F    153     47 20.1  52

In [31]:
#Tu data1 loc nhung dong co bmi >=18.5 & <= 24.9 dua vao data2
data2 <- filter(data1, bmi >= 18.5 & bmi <=24.9)
print(head(data2))

  id gender height weight  bmi age
1  1      F    150     49 21.8  53
2  2      M    165     52 19.1  65
3  3      F    157     57 23.1  64
4  4      F    156     53 21.8  56
5  5      M    160     51 19.9  54
6  6      F    153     47 20.1  52

In [32]:
#Them cot height_m = height/100 vao data1
data1 <- mutate(data1, height_m = height/100)
print(head(data1))

  id gender height weight  bmi age height_m
1  1      F    150     49 21.8  53     1.50
2  2      M    165     52 19.1  65     1.65
3  3      F    157     57 23.1  64     1.57
4  4      F    156     53 21.8  56     1.56
5  5      M    160     51 19.9  54     1.60
6  6      F    153     47 20.1  52     1.53

In [33]:
#voi data1 Order by bmi
data1 <- arrange(data1, bmi)
print(head(data1))

    id gender height weight  bmi age height_m
1  179      M    162     38 14.5  55     1.62
2 1016      F    162     40 15.2  54     1.62
3  731      F    151     35 15.4  33     1.51
4 1200      F    155     37 15.4  44     1.55
5  699      F    150     35 15.6  24     1.50
6  335      M    169     45 15.8  50     1.69

In [34]:
#Tinh gia tri trung binh cua height, weight theo gender.
gender_group = group_by(data1, gender)
summary_gender = summarise(gender_group,
                   count = n(),
                   mean.height = mean(height, na.rm = T),
                   mean.weight = mean(weight, na.rm = T))
summary_gender

  gender count mean.height mean.weight
1 F      862   153.2912    52.31090
2 M      355   165.0592    62.02254

In [36]:
#Voi data1, dem so luong theo gender va age
gender_age_group = count(data1, gender,age)
head(gender_age_group)

  gender age n
1 F      14   4
2 F      16   2
3 F      18  10
4 F      19  27
5 F      20  13
6 F      21   8

In [37]:
#chon 10 mau ngau nhien tu data1 dua vao data3
data3 <- sample_n(data1, 10)
data3

   id  gender height weight bmi  age height_m
1  121 F      150    59     26.2 77  1.50
2  838 F      158    51     20.4 56  1.58
3  666 F      155    51     21.2 26  1.55
4  378 F      148    46     21.0 45  1.48
5  356 F      154    60     25.3 55  1.54
6  565 F      144    41     19.8 81  1.44
7  151 F      149    49     22.1 38  1.49
8    8 M      167    65     23.3 50  1.67
9  207 F      160    56     21.9 41  1.60
10 204 F      154    52     21.9 50  1.54

In [38]:
#Chon 1% mau ngau nhien tu data1 dua vao data4
data4 <- sample_frac(data1, 0.01)
print(head(data4))

    id gender height weight  bmi age height_m
1  655      F    150     46 20.4  24     1.50
2  572      F    141     35 17.6  72     1.41
3  267      M    154     55 23.2  78     1.54
4 1125      F    160     63 24.6  54     1.60
5  309      M    180     68 21.0  21     1.80
6 1195      F    150     53 23.6  46     1.50